Белгипрозем_2017/src/DataProcessors/ОтправкаДокументовПоСВД/ОтправкаДокументовПоСВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтправкаДокументовПоСВД</name>
</mdclass:DataProcessor>

Белгипрозем_2017/src/InformationRegisters/УчастникиСВД/УчастникиСВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиСВД</name>
  <resources>
    <name>ИмяАдресата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортыСВД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/ФайлыДокументовГотовыхКОтправкеПоСВД/ФайлыДокументовГотовыхКОтправкеПоСВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФайлыДокументовГотовыхКОтправкеПоСВД</name>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/КешИнформацииОбОбъектах/КешИнформацииОбОбъектах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КешИнформацииОбОбъектах</name>
  <resources>
    <name>ДатаПроверкиЭП</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьКатегории</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкиОтправкиПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Переслан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолученОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолученПоСВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСВД</name>
    <type>
      <types>CatalogRef.ВидыСостоянийДокументовВСВД</types>
    </type>
  </resources>
  <resources>
    <name>СтатусЭП</name>
    <type>
      <types>EnumRef.СтатусПроверкиЭП</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеКонтроля</name>
    <type>
      <types>EnumRef.СостоянияКонтроля</types>
    </type>
  </resources>
  <resources>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокИсполненияОбщий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Проекты</types>
      <types>BusinessProcessRef.РешениеВопросовВыполненияЗадач</types>
      <types>BusinessProcessRef.Исполнение</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.Приглашение</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>BusinessProcessRef.ОбработкаИсходящегоДокумента</types>
      <types>BusinessProcessRef.ОбработкаВнутреннегоДокумента</types>
      <types>BusinessProcessRef.Поручение</types>
      <types>CatalogRef.Должности</types>
      <types>BusinessProcessRef.Утверждение</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>BusinessProcessRef.КомплексныйПроцесс</types>
      <types>BusinessProcessRef.ОбработкаВходящегоДокумента</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>BusinessProcessRef.Рассмотрение</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
      <types>BusinessProcessRef.Согласование</types>
      <types>BusinessProcessRef.Ознакомление</types>
      <types>CatalogRef.ВеткиПереписки</types>
      <types>BusinessProcessRef.Регистрация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/СтатусПроверкиЭП/СтатусПроверкиЭП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусПроверкиЭП</name>
  <enumValues>
    <name>ПодписьДействительна</name>
  </enumValues>
  <enumValues>
    <name>ПодписьНедействительна</name>
  </enumValues>
  <enumValues>
    <name>ПодписьНеПроверена</name>
  </enumValues>
  <enumValues>
    <name>ПодписиНет</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/ПравилаОтправкиСообщенийСВД/ПравилаОтправкиСообщенийСВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаОтправкиСообщенийСВД</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРазмерВсехПередаваемыхФайлов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРазмерПередаваемогоФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипыПередаваемыхФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортыСВД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Корреспонденты</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДокументов</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыИсходящихДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/ИсходящиеДокументы/ИсходящиеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсходящиеДокументы</name>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ВнутренниеДокументы</basedOn>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Document.ВходящееПисьмо</basedOn>
  <basedOn>Document.ИсходящееПисьмо</basedOn>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовКОтправке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭкземпляров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДел</name>
    <type>
      <types>CatalogRef.НоменклатураДел</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подписавшего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Ожидаемый срок ответа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПолучателиДляСписков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛичныйДоступ_Удалить</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтправки</name>
      <type>
        <types>CatalogRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтправки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПолученОтвет</name>
      <type>
        <types>CatalogRef.ВходящиеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СубъектыПерсональныхДанных</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьЭлектронныеЦифровыеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/DataProcessors/ОтправкаДокументовПоСВД/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокДокументовДляОтправкиПоСВД" Тогда
		ЗаполнитьСписокДокументов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументы

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ДокументыОтправить Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.ДокументыСостояние И Элементы.Документы.ТекущиеДанные.Состояние = 2 Тогда
		ОткрытьФорму("Справочник.ПравилаОтправкиСообщенийСВД.ФормаСписка");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("Ключ", Элементы.Документы.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Справочник.ИсходящиеДокументы.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Документы.ТекущиеДанные = Неопределено Тогда
		Файлы.Очистить();
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикДокументыПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы

&НаКлиенте
Процедура ФайлыОтправитьПриИзменении(Элемент)
	
	ФайлыОтправитьПриИзмененииНаСервере(
		Элементы.Файлы.ТекущиеДанные.Ссылка,
		Элементы.Документы.ТекущиеДанные.Ссылка,
		Элементы.Документы.ТекущиеДанные.Получатель,
		Элементы.Файлы.ТекущиеДанные.Отправить);
	
КонецПроцедуры

&НаСервере
Процедура ФайлыОтправитьПриИзмененииНаСервере(Файл, Документ, Получатель, Отправить)
	
	Запись = РегистрыСведений.ФайлыДокументовГотовыхКОтправкеПОСВД.СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.Файл = Файл;
	Запись.Получатель = Получатель;
	
	Если Отправить Тогда
		Запись.Записать();
	Иначе
		Запись.Прочитать();
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	ТекстСообщения = НСтр("ru = 'Идет отправка документов по СВД...'");
	Состояние(ТекстСообщения);
	
	ДокументыНеВыбраны = Истина;
	ВозниклиОшибки = Ложь;
	
	КоличествоОтправленных = ОтправитьСервер(ДокументыНеВыбраны, ВозниклиОшибки);
	
	Если ДокументыНеВыбраны Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отметьте хотя бы один документ.'"));
		Возврат;
	КонецЕсли;
	
	Если ВозниклиОшибки Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'При отправке некоторых документов возникли ошибки.
                                       |Их можно посмотреть в журнале регистрации.'"));
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отправка документов по СВД завершена. Отправлено документов: %1.'"),
			КоличествоОтправленных);
	Состояние(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДокументов(Команда)
	
	ЗаполнитьСписокДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокДокументов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсходящиеДокументы.Ссылка,
		|	ИсходящиеДокументы.Наименование КАК Наименование,
		|	ИсходящиеДокументы.ВидДокумента,
		|	ИсходящиеДокументы.ПодписанЭП,
		|	ИсходящиеДокументы.Организация КАК Отправитель,
		|	ИсходящиеДокументыПолучатели.Получатель КАК Получатель,
		|	ПОДСТРОКА(ИсходящиеДокументы.Содержание, 0, 1000) КАК Содержание
		|ИЗ
		|	Справочник.ИсходящиеДокументы.Получатели КАК ИсходящиеДокументыПолучатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
		|		ПО (ИсходящиеДокументы.Ссылка = ИсходящиеДокументыПолучатели.Ссылка)
		|ГДЕ
		|	ИсходящиеДокументы.ГотовКОтправке = ИСТИНА
		|	И ИсходящиеДокументы.ПометкаУдаления = ЛОЖЬ
		|	И ИсходящиеДокументыПолучатели.СпособОтправки = ЗНАЧЕНИЕ(Справочник.СпособыДоставки.СВД)
		|	И ИсходящиеДокументыПолучатели.Отправлен = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	ТаблицаДокументов = РеквизитФормыВЗначение("Документы");
	ТаблицаДокументов.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Состояние = СКорреспондентомНастроенОбменПоСВД(Выборка.Отправитель, Выборка.Получатель, Выборка.ВидДокумента);
			
		Если Не Состояние.НастроенОбменПоСВД Тогда
			НоваяСтрока.Состояние = 2;
			НоваяСтрока.СостояниеТекст = НСтр("ru = 'Не настроен обмен.'");
		ИначеЕсли Состояние.ТребуетсяПодписьЭП И Не Выборка.ПодписанЭП Тогда
			НоваяСтрока.Состояние = 1;
			НоваяСтрока.СостояниеТекст = НСтр("ru = 'Не подписан ЭП уполномеченного сотрудника.'")
		Иначе
			НоваяСтрока.Состояние = 0;
			НоваяСтрока.СостояниеТекст = НСтр("ru = 'Готов к отправке.'");
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтаФорма.ЗначениеВРеквизитФормы(ТаблицаДокументов, "Документы");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СКорреспондентомНастроенОбменПоСВД(Организация, Корреспондент, ВидДокумента)
	
	Результат = Новый Структура("НастроенОбменПоСВД, ТребуетсяПодписьЭП", Ложь, Ложь);
	Настройка = РаботаССВД.НайтиПравилоОтправкиСообщенийСВД(Организация, Корреспондент, ВидДокумента);
	Если Настройка <> Неопределено Тогда
		Если Настройка.Транспорт.ФорматСообщения = Справочники.ФорматыСообщенийСВД.ОператорЭДО1СТакском Тогда
			Результат.НастроенОбменПоСВД = Истина;
			Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеПодписи") Тогда
				Результат.ТребуетсяПодписьЭП = Истина;
			КонецЕсли;
		Иначе
			МенеджерЗаписиРегистра = РегистрыСведений.УчастникиСВД.СоздатьМенеджерЗаписи();
			МенеджерЗаписиРегистра.Адресат = Корреспондент;
			МенеджерЗаписиРегистра.Транспорт = Настройка.Транспорт;
			МенеджерЗаписиРегистра.Прочитать();
			Если МенеджерЗаписиРегистра.Выбран() Тогда
				Результат.НастроенОбменПоСВД = Истина;
				Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеПодписи")
					И Настройка.Транспорт.ФорматСообщения = Справочники.ФорматыСообщенийСВД.Сообщение1СДокументооборот Тогда
					Результат.ТребуетсяПодписьЭП = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОтправитьСервер(ДокументыНеВыбраныВозврат = Истина, ВозниклиОшибкиВозврат = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаДокументов = РеквизитФормыВЗначение("Документы");
	КоличествоОтправленных = 0;
	
	Для Каждого ДанныеСтроки Из ТаблицаДокументов Цикл
		
		Если Не ДанныеСтроки.Отправить
			Или ДанныеСтроки.Отправить И ДанныеСтроки.Состояние <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ДокументыНеВыбраныВозврат = Ложь;
		
		Документ = ДанныеСтроки.Ссылка;
		Получатель = ДанныеСтроки.Получатель;
		
		Получатели = Новый Массив;
		Получатели.Добавить(Получатель);
		
		ФайлыКОтправке = Новый Массив;
		
		ЗапросФайлов = Новый Запрос;
		ЗапросФайлов.Текст =
			"ВЫБРАТЬ
			|	Файлы.Файл
			|ИЗ
			|	РегистрСведений.ФайлыДокументовГотовыхКОтправкеПОСВД КАК Файлы
			|ГДЕ
			|	Файлы.Документ = &Документ
			|	И Файлы.Получатель = &Получатель";
		ЗапросФайлов.Параметры.Вставить("Документ", Документ);
		ЗапросФайлов.Параметры.Вставить("Получатель", Получатель);
		ВыборкаФайлов = ЗапросФайлов.Выполнить().Выбрать();
		
		Пока ВыборкаФайлов.Следующий() Цикл
			ФайлыКОтправке.Добавить(ВыборкаФайлов.Файл);
		КонецЦикла;
		
		// Отправка документа
		НачатьТранзакцию();
		Попытка
			
			ДатаПримененияФормата = Константы.ДатаНачалаПримененияНовогоФорматаСМДО.Получить();
			Дата = ТекущаяДата(); 
			//Мисофт+
			Если Дата >= ДатаПримененияФормата Тогда
				
				ОтправкаПроизведена = РаботаССВД.ОтправитьПоСВД21(Документ, Документ.ВидДокумента, Получатель, ФайлыКОтправке);
				
				Если ОтправкаПроизведена Тогда
					
					НаборЗаписей = РегистрыСведений.ФайлыДокументовГотовыхКОтправкеПОСВД.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(Документ);
					НаборЗаписей.Отбор.Получатель.Установить(Получатель);
					НаборЗаписей.Записать();
					
					ОбработанныйДокумент = Документ.ПолучитьОбъект();
					ЗаблокироватьДанныеДляРедактирования(Документ);
					ОбработанныйДокумент.ГотовКОтправке = Ложь;
					ОбработанныйДокумент.ДополнительныеСвойства.Вставить("ЗаписьПодписанногоОбъекта", Истина); // чтобы прошла запись ранее подписанного объекта
					ОбработанныйДокумент.Записать();
					РазблокироватьДанныеДляРедактирования(Документ);
					
					КоличествоОтправленных = КоличествоОтправленных + 1;
					
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
				
			Иначе
				//Мисофт-
				ОтправкаПроизведена = РаботаССВД.ОтправитьПоСВД(Документ, Получатели, ФайлыКОтправке);
				
				Если ОтправкаПроизведена Тогда
					
					НаборЗаписей = РегистрыСведений.ФайлыДокументовГотовыхКОтправкеПОСВД.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(Документ);
					НаборЗаписей.Отбор.Получатель.Установить(Получатель);
					НаборЗаписей.Записать();
					
					ОбработанныйДокумент = Документ.ПолучитьОбъект();
					ЗаблокироватьДанныеДляРедактирования(Документ);
					ОбработанныйДокумент.ГотовКОтправке = Ложь;
					ОбработанныйДокумент.ДополнительныеСвойства.Вставить("ЗаписьПодписанногоОбъекта", Истина); // чтобы прошла запись ранее подписанного объекта
					ОбработанныйДокумент.Записать();
					РазблокироватьДанныеДляРедактирования(Документ);
					
					КоличествоОтправленных = КоличествоОтправленных + 1;
					
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
			КонецЕсли;
		Исключение
			
			ОтменитьТранзакцию();
			Инфо = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Отправка документа по СВД'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,
				Документ,
				ПодробноеПредставлениеОшибки(Инфо));
			ВозниклиОшибкиВозврат = Истина;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаполнитьСписокДокументов();
	
	Возврат КоличествоОтправленных;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикДокументыПриАктивизацииСтроки()
	
	Документ = Элементы.Документы.ТекущиеДанные.Ссылка;
	Получатель = Элементы.Документы.ТекущиеДанные.Получатель;
	Если ТекущийДокумент = Документ И ТекущийПолучатель = Получатель Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийДокумент = Документ;
	ТекущийПолучатель = Получатель;
	
	ЗаполнитьСписокФайлов(ТекущийДокумент, ТекущийПолучатель);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокФайлов(Документ = Неопределено, Получатель = Неопределено)
	
	Если Не ЗначениеЗаполнено(Документ) И Не ЗначениеЗаполнено(Получатель) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка,
		|	ВЫБОР
		|		КОГДА ФайлыКОтправке.Файл ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Отправить,
		|	Файлы.Наименование КАК Наименование,
		|	ПОДСТРОКА(Файлы.Описание, 0, 140) КАК Описание,
		|	ВЫБОР
		|		КОГДА Файлы.ПометкаУдаления
		|			ТОГДА Файлы.ИндексКартинки + 1
		|		ИНАЧЕ Файлы.ИндексКартинки
		|	КОНЕЦ КАК ИндексКартинки,
		|	ВЫБОР
		|		КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписиНет)
		|			ТОГДА 0
		|		КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьНеПроверена)
		|			ТОГДА 1
		|		КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьДействительна)
		|			ТОГДА 2
		|		КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьНедействительна)
		|			ТОГДА 3
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Файлы.ПодписанЭП
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК СтатусПроверкиЭП,
		|	Файлы.Зашифрован
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФайлыДокументовГотовыхКОтправкеПоСВД КАК ФайлыКОтправке
		|		ПО (ФайлыКОтправке.Документ = Файлы.ВладелецФайла)
		|			И (ФайлыКОтправке.Получатель = &Получатель)
		|			И (ФайлыКОтправке.Файл = Файлы.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КешИнформацииОбОбъектах КАК КешИнформацииОбОбъектах
		|		ПО Файлы.Ссылка = КешИнформацииОбОбъектах.Объект
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
	Запрос.Параметры.Вставить("ВладелецФайла", Документ);
	Запрос.Параметры.Вставить("Получатель", Получатель);
	
	ТаблицаФайлов = РеквизитФормыВЗначение("Файлы");
	ТаблицаФайлов.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаФайлов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	ЭтаФорма.ЗначениеВРеквизитФормы(ТаблицаФайлов, "Файлы");
	
КонецПроцедуры

#КонецОбласти
